

'''
        Подвиг 1.

        На вход программе подаются два вещественных числа, записанных в одну строку через пробел.
        Необходимо их прочитать и вывести на экран наибольшее из этих чисел.
        Задачу решить с помощью условного оператора.



        Sample Input:

        8.7 11.0
        Sample Output:

        11.0

'''

# a, b = map(float, input().split())
#
# print(a if a > b else b)


'''
        Подвиг 2. 
        
        На вход программе подается строка со словом. 
        Необходимо его прочитать и определить, является ли это слово палиндромом 
        (одинаково читается вперед и назад, например, АННА). 
        Регистр букв не учитывать, т.е. Анна, анна, аННА - это все должно определяться, как палиндромы. 
        Если введенное слово палиндром, на экран вывести "ДА", иначе "НЕТ".



        Sample Input:
        
        Шалаш
        Sample Output:
        
        ДА
'''

# a = input()
# print("ДА" if a[:].lower() == a[::-1].lower() else "НЕТ")

# a = input().lower()
# print(['НЕТ','ДА'][a == a[::-1]]) # Если равно индекс = 1 не равно 0



'''
        Подвиг 3. 
        
        На вход программе подаются два целых положительных числа, записанных в одну строку через пробел. 
        
        Необходимо прочитать эти числа в переменные m и n (в порядке считывания). 
        Определить, если число m делится нацело на число n, то вывести на экран частное от деления (результат деления) 
        в виде целого числа. 
        
        В противном случае вывести сообщение «m на n нацело не делится» (без кавычек) и 
        вместо m и n подставить соответствующие числа, например: «13 на 2 нацело не делится».



        Sample Input 1:
        
        8 4
        Sample Output 1:
        
        2
        Sample Input 2:
        
        11 2
        Sample Output 2:
        
        11 на 2 нацело не делится
'''

# m, n = map(int, input().split())
#
# if m % n == 0:
#     print(m // n)
# else:
#     print(f'{m} на {n} нацело не делится')


# m, n = map(int, input().split())
#
# print(m // n if m % n == 0 else f'{m} на {n} нацело не делится')



'''
        Подвиг 4. 
        
        На вход программе подаются три целых положительных числа, записанных в одну строку через пробел. 
        Необходимо прочитать эти числа и убедиться, что первые два числа - это катеты прямоугольного треугольника, 
        а третье - его гипотенуза. (Подсказка: проверка делается по теореме Пифагора c**2 = a**2 + b**2). 
        Если проверка проходит (истина), то вывести на экран "ДА", иначе "НЕТ".



        Sample Input:
        
        3 4 5
        Sample Output:
        
        ДА
'''

# c, a, b = map(int, input().split())
# print(["НЕТ","ДА"][b**2 == a**2 + c**2])


'''
        Подвиг 5. 
        
        На вход программе подается четырехзначное число, которое нужно прочитать из входного потока. 
        
        Проверить, что это число оканчивается на цифру 7. 
        Вывести на экран "ДА", если это так, и "НЕТ" в противном случае.



        Sample Input:
        
        8117
        Sample Output:
        
        ДА
'''


#
# print(["НЕТ","ДА"][input()[-1] == "7"])


'''
        Подвиг 6. 
        
        На вход программе подается слово (строка). 
        Необходимо прочитать это слово и проверить, что в нем присутствуют все три буквы: t, h и o 
        (в произвольном порядке и хотя бы в одном экземпляре). 
        Реализовать программу следует с помощью одного условного оператора. 
        Если искомая проверка проходит, вывести "ДА", иначе "НЕТ".



        Sample Input:
        
        Python
        
        Sample Output:
        
        ДА
'''
# string = input()
# print(["НЕТ","ДА"]["t" in string and "h" in string and "o" in string])


'''
        Подвиг 7. 
        
        На вход программе подается строка из названий городов, записанных через пробел. 
        Необходимо прочитать эту строку и сформировать на ее основе список cities из названий городов. 
        Затем, проверить, если в списке cities присутствует город Москва, 
        то удалить этот элемент из списка. 
        Вывести на экран результирующий список cities командой:

        print(*cities)
        
        Sample Input:
        
        Уфа Астрахань Москва Самара Казань
        Sample Output:
        
        Уфа Астрахань Самара Казань

'''

# cities = list(map(str, input().split()))
#
# if 'Москва' in cities:
#     cities.remove('Москва')
#
# print(*cities)
#
# ****************************
# print(input().replace('Москва ', ''))


'''
        Подвиг 8. 
        
        На вход программе подаются четыре целых числа a, b, c, d, записанных в одну строку через пробел. 
        Необходимо прочитать эти числа и определить, войдет ли в конверт 
        с внутренними размерами a и b мм (первые два числа) 
        прямоугольная открытка с размерами с и d мм (следующие два числа). 
        Для размещения открытки в конверте необходим зазор в 1 мм с каждой стороны. 
        Открытку можно поворачивать на 90 градусов. 
        Вывести "ДА", если открытка входит, и "НЕТ" в противном случае.



        Sample Input:
        
        12 5 7 2
        Sample Output:
        
        ДА
'''

# a, b, c, d = map(int, input().split())
#
# print("ДА" if a - c >= 2 and b - d >= 2 or a - d >= 2 and b - c >= 2 else "НЕТ")
# ***********************************************************************************
# a,b,c,d = [int(i) for i in input().split()]
# if max(a,b) > max(c,d)+1 and min(a,b) > min(c,d)+1:
#     print('ДА')
# else:
#     print('НЕТ')


'''
        Подвиг 9. 
        
        На вход программе подается шестизначное число. 
        Необходимо его прочитать и определить, является ли это число счастливым. 
        
        (Счастливым называют такое шестизначное число, в котором сумма его первых трех цифр 
        равна сумме последних трех его цифр.). 
        
        Вывести "ДА", если число счастливое, и "НЕТ" в противном случае.



        Sample Input:
        
        811235
        Sample Output:
        
        ДА
'''

# a = list(map(int, input()))
# print(["НЕТ","ДА"][sum(a[0:3]) == sum(a[3:])])




'''
        Подвиг 10. 
        
        Работа светофора для пешеходов запрограммирована следующим образом: 
        
        в начале каждого часа в течение трех минут горит зеленый сигнал, 
        затем в течение двух минут – красный, 
        в течение трех минут – опять зеленый и т. д., 
        процесс повторяется.
        
        На вход программе подается вещественное число t, 
        означающее время в минутах, прошедшее с начала очередного часа. 
        
        Необходимо прочитать это число и определить, сигнал какого цвета горит для пешеходов в момент времени t 
        
        (прочитанного из входного потока). 
        
        На экран вывести сообщение (без кавычек):

        "green" - для зеленого;
        "red" - для красного.

        
        Sample Input:
        
        12.5
        Sample Output:
        
        green
'''


# t = float(input())
#
# print(['red', 'green'][t / 5 - t // 5 <= 0.60])
#
# **********************************************************
#
# print(('green', 'green', 'green', 'red', 'red')[int(float(input())) % 5])
#
# ***********************************************************
#
# minute = float(input())
# print(['green', 'red'][minute % 5 > 3])