

'''

        Подвиг 1.

        На вход программе поступает строка с вещественными числами, записанными через пробел.
        Необходимо прочитать эту строку. Затем, с помощью функции map преобразовать числа в строке в
        их вещественное представление и отобразить первые три числа.
        (Полагается, что минимум три вещественных числа имеются).
        Реализовать извлечение чисел через функцию next. Результат отобразить в строчку через пробел.

        Sample Input:

        4.35 -10.6 1.0 200.34 0.56
        Sample Output:

        4.35 -10.6 1.0
'''

print(*[v for k, v in enumerate(map(float, input().split())) if k <= 2 ])